#language: ru

Функционал: проверка заполнения Заказа

Как Менеджер по продажам я хочу
пересчет итоговой суммы документа 
чтобы итоговая сумма соответствовала данным строк товаров   

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: расчет итоговой суммы документа Заказ
* Открытие формы документа
	И я закрываю все окна клиентского приложения
	И В командном интерфейсе я выбираю "Продажи" "Заказы"
	Тогда открылось окно "Заказы товаров"
	И в таблице 'Список' я перехожу к строке:
		| "Дата"                | "Номер"     |
		| "26.04.2023 21:10:38" | "000000001" |           |
	И в таблице 'Список' я выбираю текущую строку
	Тогда открылось окно "Заказ * от *"
* Изменение цены и количества
	И в таблице 'Товары' я выбираю текущую строку
	И в таблице 'Товары' в поле с именем 'ТоварыЦена' я ввожу текст "11 000,00"
	И в таблице 'Товары' я завершаю редактирование строки
	И в таблице 'Товары' я активизирую поле с именем 'ТоварыКоличество'
	И в таблице 'Товары' я выбираю текущую строку
	И в таблице 'Товары' в поле с именем 'ТоварыКоличество' я ввожу текст "3"
	И в таблице 'Товары' я завершаю редактирование строки
* Проверка итоговой суммы
	Тогда элемент формы с именем 'ТоварыИтогСумма' стал равен "35 200"

Сценарий: проверка возможности заполнения количества услуг
* Открытие формы документа
	И я закрываю все окна клиентского приложения
	И В командном интерфейсе я выбираю "Продажи" "Заказы"
	Тогда открылось окно "Заказы товаров"
	И в таблице 'Список' я перехожу к строке:
		| "Дата"                | "Номер"     |
		| "26.04.2023 21:10:38" | "000000001" |           |
	И в таблице 'Список' я выбираю текущую строку
	Тогда открылось окно "Заказ * от *"
* Добавление строки строки услуги
	И в таблице 'Товары' я нажимаю на кнопку с именем 'ТоварыДобавить'
	И в таблице 'Товары' я нажимаю кнопку выбора у реквизита с именем 'ТоварыТовар'
	Тогда открылось окно "Товары"
	И я нажимаю на кнопку с именем 'ФормаДерево'
	И в таблице 'Список' я перехожу к строке:
		| "Код"       | "Наименование" |
		| "000000036" | "Услуги"       |
	И в таблице 'Список' я разворачиваю текущую строку
	И в таблице 'Список' я перехожу к строке:
		| "Код"       | "Наименование" |
		| "000000037" | "Доставка"     |
	И в таблице 'Список' я выбираю текущую строку
	Тогда открылось окно "Заказ * от * *"
	И в таблице 'Товары' я завершаю редактирование строки
* Изменние количества
	И в таблице 'Товары' я активизирую поле 'Количество'
	Попытка
		И в таблице 'Товары' в поле с именем 'ТоварыКоличество' я ввожу текст "10"
	Исключение
	// Количество не должно было измениться
	И в таблице 'Товары' я завершаю редактирование строки
	Тогда таблица 'Товары' содержит строки:
		| 'Товар'     | 'Количество' |
		| 'Доставка'  | ''           |
	
		 
	
	
		
	 
	

