#language: ru

@tree

Функционал: Проверка заполнения полей Заказа покупателя

Как Тестер я хочу
я хочу проверить заполнение полей заказа покупателя 
чтобы удостовериться что документ заполняется корректно   

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: подготовительный сценарий
	Когда экспорт основных данных
	
Сценарий: проверка заполнения шапки Заказа покупателя
* Открытие документа
	И я закрываю все окна клиентского приложения
	И В командном интерфейсе я выбираю "Продажи" "Заказы покупателей"
	Тогда открылось окно "Заказы покупателей"
	И я нажимаю на кнопку с именем 'FormCreate'
	Тогда открылось окно "Заказ покупателя (создание)"
* Выбор партнера с одним соглашением
	И я нажимаю кнопку выбора у поля с именем 'Partner'
	Тогда открылось окно "Партнеры"
	И в таблице 'List' я перехожу к строке:
		| "Код" | "Наименование"         |
		| "10"  | "Розничный покупатель" |
	И в таблице 'List' я выбираю текущую строку
	Тогда открылось окно "Заказ покупателя (создание) *"
	Тогда элемент формы с именем 'LegalName' стал равен "Розничный покупатель"
	Тогда элемент формы с именем 'Agreement' стал равен "Розничное"
* Выбор партнера с двумя соглашениями
	И я нажимаю кнопку выбора у поля с именем 'Partner'
	Тогда открылось окно "Партнеры"
	И в таблице 'List' я перехожу к строке:
		| "Код" | "Наименование"            |
		| "2"   | "Клиент 2 (2 соглашения)" |
	И в таблице 'List' я выбираю текущую строку
	Тогда открылось окно "Заказ покупателя (создание) *"
	Тогда элемент формы с именем 'LegalName' стал равен "Клиент 2"
	Тогда элемент формы с именем 'Agreement' стал равен ""
* Выбор соглашения
	И я нажимаю кнопку выбора у поля с именем 'Agreement'
	Тогда открылось окно "Соглашения"
	И в таблице 'List' я перехожу к строке:
		| "Вид"     | "Вид взаиморасчетов" | "Код" | "Наименование"                                        |
		| "Обычное" | "По соглашениям"     | "3"   | "Индивидуальное соглашение 2 (расчет по соглашениям)" |
	И в таблице 'List' я активизирую поле с именем 'Description'
	И в таблице 'List' я выбираю текущую строку
	Тогда открылось окно "Заказ покупателя (создание) *"
	Тогда элемент формы с именем 'Agreement' стал равен "Индивидуальное соглашение 2 (расчет по соглашениям)"
* Очистка партнера и проверка не доступности контрагента
	И я нажимаю кнопку очистить у поля с именем 'Partner'
	Тогда элемент формы с именем 'Agreement' стал равен ""
	И элемент формы с именем 'LegalName' не доступен
	И я закрываю все окна клиентского приложения
	