#language: ru

@tree

Функционал: Тестирование отчета D2001 Продажи

Как Тестировщик я хочу
протестировать отчет по продажам 
чтобы проверить что у пользователя отчет сформируется   

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: подготовительный сценарий
	Когда экспорт основных данных
	Когда экспорт документа продаж
	И я выполняю код встроенного языка на сервере
		| 'Документы.SalesInvoice.НайтиПоНомеру(1).ПолучитьОбъект().Записать(РежимЗаписиДокумента.Проведение);' |

Сценарий: проверка отчета D2001 Продажи
	И я закрываю все окна клиентского приложения
	И В командном интерфейсе я выбираю "Отчеты" "D2001 Продажи"
	Тогда открылось окно "D2001 Продажи"
	И я нажимаю на кнопку с именем 'FormGenerate'
	Дано Табличный документ "Result" равен макету "Продажи_эталон" по шаблону	
