#language: ru

@tree

Функционал: Создание копий Номенклатуры

Как тестировщик я хочу
создать несколько новых элементов справочника Номенклатура 
чтобы проводить дальнейшие тесты   

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: создание новой номенклатуры
	И я закрываю все окна клиентского приложения
	И я делаю 10 раз
		// Для создания уникального наименования используем случайные символы, чтобы тест можно было запускать несколько раз и наименования номенклатуры не повторялись;
		// Вариант создания наименования: добавлять не случайный набор символов, а текущую дату, но тогда нужна пауза между созданиями, что замедляет выполнение
		И я проверяю или создаю для справочника "Items" объекты:
			| 'Ref'                                                               | 'DeletionMark' | 'Code' | 'ItemType'                                                          | 'Unit'                                                          | 'MainPricture' | 'Vendor'                                                           | 'ItemID' | 'PackageUnit' | 'Description_en'                                 | 'Description_hash' | 'Description_ru' | 'Description_tr' |
			| '{"e1cib/data/Catalog.Items?ref=" + StrReplace(New UUID, "-", "")}' | 'False'        |        | 'e1cib/data/Catalog.ItemTypes?ref=b762b13668d0905011eb76684b9f6879' | 'e1cib/data/Catalog.Units?ref=b762b13668d0905011eb76684b9f687b' |                | 'e1cib/data/Catalog.Partners?ref=b762b13668d0905011eb7663e35d794d' | '58792'  | ''            | '{"Номенклатура (копия " + UserSettingsServer.GeneratePassword() + ")"}' | ''                 | ''               | ''               |
		
