#language: ru
@tree
@ExportScenarios
@IgnoreOnCIMainBuild

Функционал: Загрузка торговых документов для тестирования

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: Загрузка торговых документов

	* Загрузка документа ПриходТовара
		И я проверяю или создаю для документа "ПриходТовара" объекты:
			| 'Ссылка'                                                                | 'ПометкаУдаления' | 'Номер'     | 'Дата'                | 'Проведен' | 'Поставщик'                                                              | 'Склад'                                                             | 'Валюта'                                                            | 'Организация'                                                            |
			| 'e1cib/data/Документ.ПриходТовара?ref=a9a2e0d04548c64011f0706c1a1d311e' | 'False'           | '000000136' | '01.02.2024 12:00:00' | 'True'     | 'e1cib/data/Справочник.Контрагенты?ref=8ca0000d8843cd1b11dc8d043d710076' | 'e1cib/data/Справочник.Склады?ref=a9b000055d49b45e11db8b8bee7616e1' | 'e1cib/data/Справочник.Валюты?ref=a9b000055d49b45e11db8c4421dda1c5' | 'e1cib/data/Справочник.Организации?ref=8d34000d8843cd1b11dd2bea12f94c64' |
			| 'e1cib/data/Документ.ПриходТовара?ref=a9a2e0d04548c64011f0706c1a1d311f' | 'False'           | '000000137' | '02.02.2024 12:00:00' | 'True'     | 'e1cib/data/Справочник.Контрагенты?ref=8ca0000d8843cd1b11dc8d043d710079' | 'e1cib/data/Справочник.Склады?ref=a9b000055d49b45e11db8b8bdc1aadc2' | 'e1cib/data/Справочник.Валюты?ref=a9b000055d49b45e11db8c4421dda1c5' | 'e1cib/data/Справочник.Организации?ref=8d34000d8843cd1b11dd2bea12f94c64' |

		И я перезаполняю для объекта табличную часть "Товары":
			| 'Ссылка'                                                                | 'Товар'                                                             | 'Цена' | 'Количество' | 'Сумма' |
			| 'e1cib/data/Документ.ПриходТовара?ref=a9a2e0d04548c64011f0706c1a1d311e' | 'e1cib/data/Справочник.Товары?ref=8ca1000d8843cd1b11dc8eb360f70b4d' | 150    | 100          | 15000   |
			| 'e1cib/data/Документ.ПриходТовара?ref=a9a2e0d04548c64011f0706c1a1d311e' | 'e1cib/data/Справочник.Товары?ref=8ca0000d8843cd1b11dc8d043d710077' | 15     | 200          | 3000    |
			| 'e1cib/data/Документ.ПриходТовара?ref=a9a2e0d04548c64011f0706c1a1d311f' | 'e1cib/data/Справочник.Товары?ref=8ca1000d8843cd1b11dc8eb360f70b4d' | 150    | 200          | 30000   |
			| 'e1cib/data/Документ.ПриходТовара?ref=a9a2e0d04548c64011f0706c1a1d311f' | 'e1cib/data/Справочник.Товары?ref=8ca0000d8843cd1b11dc8d043d710077' | 15     | 400          | 6000    |

	* Загрузка документа РасходТовара
		И я проверяю или создаю для документа "РасходТовара" объекты:
			| 'Ссылка'                                                                | 'ПометкаУдаления' | 'Номер'     | 'Дата'                | 'Проведен' | 'Покупатель'                                                             | 'Склад'                                                             | 'Валюта'                                                            | 'ВидЦен'                                                             | 'ОбоснованиеОтгрузки' | 'Организация'                                                            |
			| 'e1cib/data/Документ.РасходТовара?ref=a9a2e0d04548c64011f0706c1a1d3120' | 'False'           | '000000108' | '01.03.2024 12:00:00' | 'True'     | 'e1cib/data/Справочник.Контрагенты?ref=a9b000055d49b45e11db8e8bd1cb82a8' | 'e1cib/data/Справочник.Склады?ref=a9b000055d49b45e11db8b8bdc1aadc2' | 'e1cib/data/Справочник.Валюты?ref=a9b000055d49b45e11db8c4421dda1c5' | 'e1cib/data/Справочник.ВидыЦен?ref=a9b000055d49b45e11db8c4c9d5c4224' | ''                    | 'e1cib/data/Справочник.Организации?ref=8d34000d8843cd1b11dd2bea12f94c64' |

		И я перезаполняю для объекта табличную часть "Товары":
			| 'Ссылка'                                                                | 'Товар'                                                             | 'Цена' | 'Количество' | 'Сумма' |
			| 'e1cib/data/Документ.РасходТовара?ref=a9a2e0d04548c64011f0706c1a1d3120' | 'e1cib/data/Справочник.Товары?ref=8ca1000d8843cd1b11dc8eb360f70b4d' | 300    | 10           | 3000    |
			| 'e1cib/data/Документ.РасходТовара?ref=a9a2e0d04548c64011f0706c1a1d3120' | 'e1cib/data/Справочник.Товары?ref=8d3a000d8843cd1b11dd321ba7a30aaf' | 200    | 1            | 200     |

	* Загрузка документа Заказ
		И я проверяю или создаю для документа "Заказ" объекты:
			| 'Ссылка'                                                         | 'ПометкаУдаления' | 'Номер'     | 'Дата'                | 'Проведен' | 'Покупатель'                                                             | 'Склад'                                                             | 'Валюта' | 'ВидЦен'                                                             | 'Организация'                                                            | 'СостояниеЗаказа'              | 'Автор' | 'Сумма' |
			| 'e1cib/data/Документ.Заказ?ref=a9a2e0d04548c64011f07087b8ecef6b' | 'False'           | '000000022' | '01.03.2024 12:00:01' | 'True'     | 'e1cib/data/Справочник.Контрагенты?ref=a9b000055d49b45e11db8e8bd1cb82a8' | 'e1cib/data/Справочник.Склады?ref=a9b000055d49b45e11db8b8bdc1aadc2' | ''       | 'e1cib/data/Справочник.ВидыЦен?ref=a9b000055d49b45e11db8c4c9d5c4226' | 'e1cib/data/Справочник.Организации?ref=8d34000d8843cd1b11dd2bea12f94c65' | 'Enum.СостоянияЗаказов.Открыт' | ''      | 3       |

		И я перезаполняю для объекта табличную часть "Товары":
			| 'Ссылка'                                                         | 'Товар'                                                             | 'Цена' | 'Количество' | 'Сумма' |
			| 'e1cib/data/Документ.Заказ?ref=a9a2e0d04548c64011f07087b8ecef6b' | 'e1cib/data/Справочник.Товары?ref=8ca1000d8843cd1b11dc8eb360f70b4d' | 1      | 1            | 1       |
			| 'e1cib/data/Документ.Заказ?ref=a9a2e0d04548c64011f07087b8ecef6b' | 'e1cib/data/Справочник.Товары?ref=8ca0000d8843cd1b11dc8d043d710077' | 2      | 1            | 2       |

	* Проведение документов
		И я выполняю код встроенного языка на сервере
			| 'Документы.ПриходТовара.НайтиПоНомеру("000000136").ПолучитьОбъект().Записать(РежимЗаписиДокумента.Проведение);' |
			| 'Документы.ПриходТовара.НайтиПоНомеру("000000137").ПолучитьОбъект().Записать(РежимЗаписиДокумента.Проведение);' |
			| 'Документы.РасходТовара.НайтиПоНомеру("000000108").ПолучитьОбъект().Записать(РежимЗаписиДокумента.Проведение);' |
			| 'Документы.Заказ.НайтиПоНомеру("000000022").ПолучитьОбъект().Записать(РежимЗаписиДокумента.Проведение);'        |

