#language: ru

@tree

Функционал: Проверка возможности добавления картинок к справочнику Товары

Как менеджер я хочу
добавить картинку к товару 
чтобы посмотреть как выглядит товар   

Контекст:
	Дано я подключаю профиль TestClient "Этот клиент"
	
Сценарий: проверка добавления картинки
	* Загрузка основных данных
		И загрузка основных данных
	* Открытие товара
		И я закрываю все окна клиентского приложения
		И Я открываю навигационную ссылку "e1cib/data/Справочник.Товары?ref=a9a2e0d04548c64011f0704d483e393d"
		Тогда открылось окно "Товар без картинки (Товар)"
	* Добавление картинки
		И я нажимаю кнопку выбора у поля с именем 'ФайлКартинки'
		Тогда открылось окно "Файлы"
		И я нажимаю на кнопку с именем 'ФормаСоздать'
		Тогда открылось окно "Файл (создание)"
		И в поле с именем 'Наименование' я ввожу текст "Тестовая картинка"
		И я выбираю файл '$КаталогПроекта$\Features\Files\Картинка товара.png'
		И я нажимаю на кнопку с именем 'ВыбратьФайлСДискаИЗаписать'
		Тогда открылось окно "Тестовая картинка (Файл)"
		И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
		И я жду закрытия окна "Тестовая картинка (Файл)" в течение 20 секунд
		Тогда открылось окно "Файлы"
		И в таблице 'Список' я перехожу к строке:
			| 'Наименование'      |
			| 'Тестовая картинка' |
		И в таблице 'Список' я выбираю текущую строку
		Тогда открылось окно "Товар без картинки (Товар) *"
		И я нажимаю на кнопку с именем 'ФормаЗаписать'