#language: ru

@tree

Функционал: Проверка отчета Остатки

Как тестировщик я хочу
проверить отчет по остаткам 
чтобы проверить, что отчет формируется корректно   

Контекст:
	Дано я подключаю профиль TestClient "Этот клиент"

Сценарий: проверка отчета Остатки
	* Загрузка данных
		И загрузка основных данных
		И загрузка торговых документов
	* Открытие отчета
		И я закрываю все окна клиентского приложения
		И В командном интерфейсе я выбираю "Товарные запасы" "Остатки товаров"
		Тогда открылось окно "Остатки товаров"
	* Проверка стандартного отчета
		И я нажимаю на кнопку с именем 'ФормаСтандартныеНастройки'
		И я нажимаю на кнопку с именем 'ФормаСформировать'
		Дано Табличный документ "Результат" равен макету "Остатки (эталон)" по шаблону
	* Проверка с отбором по складу
		И из выпадающего списка с именем 'КомпоновщикНастроекПользовательскиеНастройкиЭлемент2Значение' я выбираю точное значение "Малый"
		И я нажимаю на кнопку с именем 'ФормаСформировать'
		Дано Табличный документ "Результат" равен макету "Остатки по складу (эталон)" по шаблону
