#language: ru

@tree

Функционал: Проверка документа "Расход товара"

Как тестировщик я хочу
проверить документ "Расход товара" 
чтобы удостовериться, что он работает нормально   

Контекст:
	Дано я подключаю профиль TestClient "Этот клиент"

Сценарий: создание и проверка заполнения документа "Расход товара"
	* Загрузка данных
		И я закрываю все окна клиентского приложения
		И загрузка основных данных
	* Создание документа
		И В командном интерфейсе я выбираю "Продажи" "Документы продаж"
		Тогда открылось окно "Документы продаж"
		И я нажимаю на кнопку с именем 'ФормаСоздатьПоПараметруРасходТовара'
		Тогда открылось окно "Продажа товара (создание)"
	* Выбор организации без валютного учета	
		И из выпадающего списка с именем 'Организация' я выбираю точное значение "ООО \"1000 мелочей\""
		Тогда элемент формы с именем 'Организация' стал равен "ООО \"1000 мелочей\""
		И элемент формы с именем 'Валюта' отсутствует на форме
	* Выбор организации с валютным учетом					
		И из выпадающего списка с именем 'Организация' я выбираю точное значение "ООО \"Все для дома\""
		Тогда элемент формы с именем 'Организация' стал равен "ООО \"Все для дома\""
		И элемент формы с именем 'Валюта' присутствует на форме
	* Продолжение заполнения
		И из выпадающего списка с именем 'ВидЦен' я выбираю точное значение "Розничная"
		Тогда элемент формы с именем 'ВидЦен' стал равен "Розничная"
		И из выпадающего списка с именем 'Валюта' я выбираю точное значение "Рубли"
		Тогда элемент формы с именем 'Валюта' стал равен "Рубли"
		И я нажимаю кнопку выбора у поля с именем 'Покупатель'
		Тогда открылось окно "Контрагенты"
		И я нажимаю на кнопку с именем 'ФормаСписок'
		И в таблице 'Список' я перехожу к строке:
			| "Код"       | "Наименование"    |
			| "000000007" | "Попов Б.В. ИЧП " |
		И в таблице 'Список' я выбираю текущую строку
		Тогда элемент формы с именем 'Покупатель' стал равен "Попов Б.В. ИЧП "
		И из выпадающего списка с именем 'Склад' я выбираю точное значение "Малый"
		Тогда элемент формы с именем 'Склад' стал равен "Малый"
	* Заполнение таблицы Товары по команде Подбор
		И в таблице 'Товары' я нажимаю на кнопку с именем 'КомандаПодбор'
		Тогда открылось окно "Подбор товара"
		И в таблице 'ДеревоТоваров' я разворачиваю строку:
			| "Наименование" |
			| "Товары"       |
		И в таблице 'ДеревоТоваров' я разворачиваю строку:
			| "Наименование" |
			| "Продукты"     |
		И в таблице 'ДеревоТоваров' я перехожу к строке:
			| "Наименование" |
			| "Продукты"     |
		И в таблице 'СписокТоваров' я перехожу к строке:
			| "Код"       | "Наименование" |
			| "000000032" | "Торт "        |
		И в таблице 'СписокТоваров' я выбираю текущую строку
		И в таблице 'Товары' в поле с именем 'ТоварыКоличество' я ввожу текст "2,00"
		И в таблице 'Товары' я завершаю редактирование строки
		И я нажимаю на кнопку с именем 'ОК'
		Тогда открылось окно "Продажа товара (создание) *"
		И в таблице 'Товары' в поле с именем 'ТоварыЦена' я ввожу текст "100,00"
		Тогда таблица 'Товары' стала равной:
			| 'N' | 'Товар' | 'Цена'   | 'Количество' | 'Сумма'  |
			| '1' | 'Торт ' | '100,00' | '2,00'       | '200,00' |
	* Заполнение таблицы Товары вручную
		И в таблице 'Товары' я нажимаю на кнопку с именем 'ТоварыДобавить'
		И в таблице 'Товары' я нажимаю кнопку выбора у реквизита с именем 'ТоварыТовар'
		Тогда открылось окно "Товары"
		И я нажимаю на кнопку с именем 'ФормаСписок'
		И в таблице 'Список' я перехожу к строке:
			| "Код"       | "Наименование" |
			| "000000029" | "Хлеб"         |
		И в таблице 'Список' я выбираю текущую строку
		Тогда открылось окно "Продажа товара (создание) *"
		И в таблице 'Товары' в поле с именем 'ТоварыЦена' я ввожу текст "50,00"
		И в таблице 'Товары' я завершаю редактирование строки
		И в таблице 'Товары' я нажимаю на кнопку с именем 'ТоварыДобавить'
		И в таблице 'Товары' я нажимаю кнопку выбора у реквизита с именем 'ТоварыТовар'
		Тогда открылось окно "Товары"
		И в таблице 'Список' я перехожу к строке:
			| "Код"       | "Наименование" |
			| "000000037" | "Доставка"     |
		И в таблице 'Список' я выбираю текущую строку
		Тогда открылось окно "Продажа товара (создание) *"
		И в таблице 'Товары' в поле с именем 'ТоварыЦена' я ввожу текст "20,00"
		И в таблице 'Товары' я завершаю редактирование строки
		Тогда таблица 'Товары' стала равной:
			| 'N' | 'Товар'    | 'Цена'   | 'Количество' | 'Сумма'  |
			| '1' | 'Торт '    | '100,00' | '2,00'       | '200,00' |
			| '2' | 'Хлеб'     | '50,00'  | '1,00'       | '50,00'  |
			| '3' | 'Доставка' | '20,00'  | ''           | '20,00'  |
	* Проверка смены цен у товаров и заполнения подвала при изменении виды цен		
		И из выпадающего списка с именем 'ВидЦен' я выбираю точное значение "Оптовая"
		Тогда таблица 'Товары' стала равной:
			| 'N' | 'Товар'    | 'Цена'   | 'Количество' | 'Сумма'  |
			| '1' | 'Торт '    | '150,00' | '2,00'       | '300,00' |
			| '2' | 'Хлеб'     | '50,00'  | '1,00'       | '50,00'  |
			| '3' | 'Доставка' | '25,00'  | ''           | '25,00'  |
		Тогда элемент формы с именем 'ТоварыИтогКоличество' стал равен "4"	
		Тогда элемент формы с именем 'ТоварыИтогСумма' стал равен "375"	
		И я нажимаю на кнопку с именем 'ФормаЗаписать'
		Тогда открылось окно "Продажа * от *"		
		И я запоминаю значение поля "Номер" как "Номер"
		И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
		И я жду закрытия окна "Продажа * от *" в течение 20 секунд
		Тогда открылось окно "Документы продаж"
	* Открытие созданного документа
		Когда открылось окно "Документы продаж"
		И в таблице 'Список' я перехожу к строке:
			| "Номер"   |
			| "$Номер$" |
		И в таблице 'Список' я выбираю текущую строку
		Тогда открылось окно "Продажа * от *"
		И я нажимаю на кнопку с именем 'ФормаОтменаПроведения'

Сценарий: Проверка движений документа "Расход товара" по регистру "Взаиморасчеты"
	* Загрузка данных
		И загрузка основных данных
		И загрузка торговых документов
	* Проверка движения
		И я закрываю все окна клиентского приложения
		И Я открываю навигационную ссылку "e1cib/data/Документ.РасходТовара?ref=a9a2e0d04548c64011f0706c1a1d3120"
		Когда открылось окно "Продажа * от *"
		И В текущем окне я нажимаю кнопку командного интерфейса "Регистр взаиморасчетов с контрагентами"
		Тогда таблица 'Список' стала равной:
			| 'Период'              | 'Регистратор'                              | 'Номер строки' | 'Контрагент'      | 'Сумма'    | 'Валюта' |
			| '01.03.2024 12:00:00' | 'Продажа 000000108 от 01.03.2024 12:00:00' | '1'            | 'Попов Б.В. ИЧП ' | '3 200,00' | 'Рубли'  |

Сценарий: Проверка движений документа "Расход товара" по регистру "Продажи"
	* Загрузка данных
		И загрузка основных данных
		И загрузка торговых документов
	* Проверка движения
		И я закрываю все окна клиентского приложения
		И Я открываю навигационную ссылку "e1cib/data/Документ.РасходТовара?ref=a9a2e0d04548c64011f0706c1a1d3120"
		Когда открылось окно "Продажа * от *"
		И В текущем окне я нажимаю кнопку командного интерфейса "Регистр продаж"
		Тогда таблица 'Список' стала равной:
			| 'Период'              | 'Регистратор'                              | 'Номер строки' | 'Покупатель'      | 'Товар'    | 'Количество' | 'Сумма'    |
			| '01.03.2024 12:00:00' | 'Продажа 000000108 от 01.03.2024 12:00:00' | '1'            | 'Попов Б.В. ИЧП ' | 'Торт '    | '10,00'      | '3 000,00' |
			| '01.03.2024 12:00:00' | 'Продажа 000000108 от 01.03.2024 12:00:00' | '2'            | 'Попов Б.В. ИЧП ' | 'Доставка' | '1,00'       | '200,00'   |

Сценарий: Проверка движений документа "Расход товара" по регистру "Товарные запасы"
	* Загрузка данных
		И загрузка основных данных
		И загрузка торговых документов
	* Проверка движения
		И я закрываю все окна клиентского приложения
		И Я открываю навигационную ссылку "e1cib/data/Документ.РасходТовара?ref=a9a2e0d04548c64011f0706c1a1d3120"
		Когда открылось окно "Продажа * от *"
		И В текущем окне я нажимаю кнопку командного интерфейса "Регистр товарных запасов"
		Тогда таблица 'Список' стала равной:
			| 'Период'              | 'Регистратор'                              | 'Номер строки' | 'Товар' | 'Склад' | 'Количество' |
			| '01.03.2024 12:00:00' | 'Продажа 000000108 от 01.03.2024 12:00:00' | '1'            | 'Торт ' | 'Малый' | '10,00'      |

Сценарий: Проверка печатной формы документа "Расход товара" по регистру "Товарные запасы"
	* Загрузка данных
		И загрузка основных данных
		И загрузка торговых документов
	* Проверка печатной формы
		И я закрываю все окна клиентского приложения
		И Я открываю навигационную ссылку "e1cib/data/Документ.РасходТовара?ref=a9a2e0d04548c64011f0706c1a1d3120"
		Когда открылось окно "Продажа * от *"
		И я нажимаю на кнопку с именем 'ФормаДокументРасходТовараПечатьРасходнойНакладной'
		Дано Табличный документ "SpreadsheetDocument" равен макету "Макет Расход товара" по шаблону
			
								