#language: ru

@tree

Функционал: Проверка пользователя Продавец

Как продавец я хочу
изучить возможности создания документов 
чтобы понять что я могу делать в программе   

Контекст:
	Дано я закрываю сеанс текущего клиента тестирования
	Дано Я копирую текущий профиль TestClient с установкой параметров:
		| 'Имя'          | 'Синоним'      | 'Логин'    |
		| 'ТестПродавец' | 'ТестПродавец' | 'Продавец' |
	Дано я подключаю профиль TestClient "ТестПродавец"
	
Сценарий: Создание документа "Расход товара"
	* Загрузка данных
		// По тексту задания тут должна быть ошибка, но её нет, обходить нечего
		И я закрываю все окна клиентского приложения
		И загрузка основных данных
	* Создание документа
		И В командном интерфейсе я выбираю "Продажи" "Продажи"
		Тогда открылось окно "Продажи товара"
		И я нажимаю на кнопку с именем 'ФормаСоздать'
		Тогда открылось окно "Продажа товара (создание)"
	* Заполнение шапки
		И из выпадающего списка с именем 'Организация' я выбираю точное значение "ООО \"1000 мелочей\""
		Тогда элемент формы с именем 'Организация' стал равен "ООО \"1000 мелочей\""
		И я нажимаю кнопку выбора у поля с именем 'Покупатель'
		Тогда открылось окно "Контрагенты"
		И я нажимаю на кнопку с именем 'ФормаСписок'
		И в таблице 'Список' я перехожу к строке:
			| "Код"       | "Наименование"    |
			| "000000007" | "Попов Б.В. ИЧП " |
		И в таблице 'Список' я выбираю текущую строку
		Тогда элемент формы с именем 'Покупатель' стал равен "Попов Б.В. ИЧП "
		Тогда элемент формы с именем 'ВидЦен' стал равен "Мелкооптовая"
		И из выпадающего списка с именем 'Склад' я выбираю точное значение "Большой"
		Тогда элемент формы с именем 'Склад' стал равен "Большой"
	* Заполнение таблицы Товары
		И в таблице 'Товары' я нажимаю на кнопку с именем 'ТоварыДобавить'
		И в таблице 'Товары' я нажимаю кнопку выбора у реквизита с именем 'ТоварыТовар'
		Тогда открылось окно "Товары"
		И я нажимаю на кнопку с именем 'ФормаСписок'
		И в таблице 'Список' я перехожу к строке:
			| "Код"       | "Наименование" |
			| "000000029" | "Хлеб"         |
		И в таблице 'Список' я выбираю текущую строку
		Тогда открылось окно "Продажа товара (создание) *"
		И в таблице 'Товары' в поле с именем 'ТоварыЦена' я ввожу текст "50,00"
		И в таблице 'Товары' я завершаю редактирование строки
		И в таблице 'Товары' я нажимаю на кнопку с именем 'ТоварыДобавить'
		И в таблице 'Товары' я нажимаю кнопку выбора у реквизита с именем 'ТоварыТовар'
		Тогда открылось окно "Товары"
		И в таблице 'Список' я перехожу к строке:
			| "Код"       | "Наименование" |
			| "000000037" | "Доставка"     |
		И в таблице 'Список' я выбираю текущую строку
		Тогда открылось окно "Продажа товара (создание) *"
		И в таблице 'Товары' в поле с именем 'ТоварыЦена' я ввожу текст "20,00"
		И в таблице 'Товары' я завершаю редактирование строки
		Тогда таблица 'Товары' стала равной:
			| 'N' | 'Товар'    | 'Цена'   | 'Количество' | 'Сумма'  |
			| '1' | 'Хлеб'     | '50,00'  | '1,00'       | '50,00'  |
			| '2' | 'Доставка' | '20,00'  | ''           | '20,00'  |
		И я нажимаю на кнопку с именем 'ФормаЗаписать'
		Тогда открылось окно "Продажа * от *"		
		И я запоминаю значение поля "Номер" как "Номер"
		И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
		И я жду закрытия окна "Продажа * от *" в течение 20 секунд
		Тогда открылось окно "Продажи товара"
	* Открытие созданного документа
		Когда открылось окно "Продажи товара"
		И в таблице 'Список' я перехожу к строке:
			| "Номер"   |
			| "$Номер$" |
		И в таблице 'Список' я выбираю текущую строку
		Тогда открылось окно "Продажа * от *"
	* Распроведение документа
		Когда открылось окно "Продажа * от *"
		И я нажимаю на кнопку с именем 'ФормаОтменаПроведения'

Сценарий: Просмотр документа "Заказ"
	* Загрузка данных
		И загрузка основных данных
		И загрузка торговых документов
	* Открытие документа
		И я закрываю все окна клиентского приложения
		И В командном интерфейсе я выбираю "Продажи" "Заказы"
		Тогда открылось окно "Заказы товаров"
		И элемент формы с именем 'ФормаСоздать' отсутствует на форме
		И в таблице 'Список' я перехожу к строке:
			| "Номер"     |
			| "000000022" |
		И в таблице 'Список' я выбираю текущую строку
		Тогда открылось окно "Заказ * от *"
	* Проверка доступности и видимости
		Если из выпадающего списка с именем 'Организация' я выбираю точное значение "ООО \"1000 мелочей\"" Тогда
			Тогда я вызываю исключение "Заказ доступен для редактирования"			
		Если я нажимаю на кнопку с именем 'ФормаЗаписать' Тогда
			Тогда я вызываю исключение "Заказ доступен для редактирования"			
		И я закрываю TestClient "ТестПродавец"